# BehaviorType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryData..::..BehaviorType Property
PipeFittingAndAccessoryData Class See Also
---
The behavior type of the pipe fitting or pipe accessory.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int BehaviorType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BehaviorType As Integer
	Get
```

Visual C++
---
```text
public:
property int BehaviorType {
	int get ();
}
```

# See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace